pseg_paddle/stress_test/pseg_stress_test.txt
########## Pseg-Length-100-Concurrency-5 ##########

Summary:
  Count:	391
  Total:	5.00 s
  Slowest:	265.91 ms
  Fastest:	19.84 ms
  Average:	63.71 ms
  Requests/sec:	78.15

Response time histogram:
  19.839 [1]	|
  44.446 [131]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  69.053 [68]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  93.660 [59]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  118.267 [23]	|∎∎∎∎∎∎∎
  142.874 [17]	|∎∎∎∎∎
  167.481 [4]	|∎
  192.087 [0]	|
  216.694 [2]	|∎
  241.301 [0]	|
  265.908 [2]	|∎

Latency distribution:
  10 % in 24.13 ms 
  25 % in 32.90 ms 
  50 % in 50.98 ms 
  75 % in 82.77 ms 
  90 % in 111.24 ms 
  95 % in 131.03 ms 
  99 % in 206.20 ms 

Status code distribution:
  [OK]            307 responses   
  [Unavailable]   5 responses     
  [Internal]      79 responses    

Error distribution:
  [79]   rpc error: code = Internal desc = Maybe RPC Error.          
  [5]    rpc error: code = Unavailable desc = transport is closing